RIET/src/Documents/CustomsFilesLight/CustomsFilesLight.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CustomsFilesLight</name>
  <comment>Декларация на товары (легкая версия) / Таможенный приходный ордер</comment>
  <basedOn>Document.Поставка</basedOn>
  <basedOn>Document.ExportShipment</basedOn>
  <basedOn>Document.CustomsFilesLight</basedOn>
  <basedOn>Document.ГТД</basedOn>
  <registerRecords>AccumulationRegister.ExportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>AccumulationRegister.ItemsWithoutCVCDecision</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDeposits</registerRecords>
  <registerRecords>InformationRegister.CustomsFilesOfGoods</registerRecords>
  <registerRecords>AccumulationRegister.QtyOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.НеоплаченныеТПО</registerRecords>
  <registerRecords>InformationRegister.ExpiryDatesOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.CustomsDepositsToRefund</registerRecords>
  <registerRecords>AccumulationRegister.InternationalAndDomesticFactCosts</registerRecords>
  <registerRecords>InformationRegister.AdditionalDataOfItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.ImportItemsWithoutCustomsFiles</registerRecords>
  <registerRecords>InformationRegister.ResponsiblesForItemsInTemporaryImpExp</registerRecords>
  <registerRecords>AccumulationRegister.СтоимостьТоваровПоТПО</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceLinesCosts</registerRecords>
  <attributes>
    <name>TypeOfTransaction</name>
    <type>
      <types>EnumRef.TypesOfCustomsFileLightTransaction</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsPost</name>
    <type>
      <types>CatalogRef.CustomsPosts</types>
    </type>
  </attributes>
  <attributes>
    <name>SeqNo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>SoldTo</name>
    <type>
      <types>CatalogRef.SoldTo</types>
    </type>
  </attributes>
  <attributes>
    <name>CCA</name>
    <type>
      <types>CatalogRef.Agents</types>
    </type>
  </attributes>
  <attributes>
    <name>ImportExport</name>
    <type>
      <types>EnumRef.ИмпортЭкспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>PermanentTemporary</name>
    <type>
      <types>EnumRef.PermanentTemporary</types>
    </type>
  </attributes>
  <attributes>
    <name>Regime</name>
    <type>
      <types>CatalogRef.CustomsRegimes</types>
    </type>
  </attributes>
  <attributes>
    <name>PSAContract</name>
    <type>
      <types>CatalogRef.PSAContracts</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>InvoiceCurrencyRate</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CustomsValue</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ReleaseDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.ExportShipment</types>
      <types>DocumentRef.Поставка</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsFile</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositAmountToRefund</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтогоПоГрафеВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PaidByCCA</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.CountriesOfProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CustomsDepositRefundTo</name>
    <type>
      <types>EnumRef.CustomsDepositsRefundTo</types>
    </type>
  </attributes>
  <attributes>
    <name>ProcessLevel</name>
    <type>
      <types>CatalogRef.ProcessLevels</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ССD</name>
    <type>
      <types>DocumentRef.ГТД</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileHTC</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CustomsFileNetWeight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <comment>RGS - Используется для TKG</comment>
      <type>
        <types>CatalogRef.ТипыНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Goods</name>
    <attributes>
      <name>AU</name>
      <type>
        <types>CatalogRef.КостЦентры</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceTotalValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceLine</name>
      <type>
        <types>CatalogRef.СтрокиИнвойса</types>
      </type>
    </attributes>
    <attributes>
      <name>POLine</name>
      <type>
        <types>CatalogRef.СтрокиЗаявкиНаЗакупку</types>
      </type>
    </attributes>
    <attributes>
      <name>DescriptionForCustoms</name>
      <type>
        <types>EnumRef.DescriptionForCustoms</types>
      </type>
    </attributes>
    <attributes>
      <name>InvoiceCorrectionValue</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>PaymentKind</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Sum</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PaidByCCA</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>InTheSetoffCustomsDeposit</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccumulationRegisters/ItemsWithoutCVCDecision/ItemsWithoutCVCDecision.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ItemsWithoutCVCDecision</name>
  <resources>
    <name>Ресурс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Item</name>
    <type>
      <types>CatalogRef.СтрокиИнвойса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CustomsBond</name>
    <type>
      <types>DocumentRef.CustomsFilesLight</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

RIET/src/Enums/TypesOfCustomsFileLightTransaction/TypesOfCustomsFileLightTransaction.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TypesOfCustomsFileLightTransaction</name>
  <enumValues>
    <name>CustomsFileLight</name>
  </enumValues>
  <enumValues>
    <name>ТПО</name>
  </enumValues>
  <enumValues>
    <name>CustomsBond</name>
  </enumValues>
  <enumValues>
    <name>CustomsBondClosing</name>
  </enumValues>
</mdclass:Enum>

RIET/src/Documents/CustomsFilesLight/Forms/ФормаПодбораItems/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполним таблицу значений и настроим видимость некоторых колонок
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("CurrentItems", Параметры.CurrentItems);
	
	Если Параметры.TypeOfTransaction = Перечисления.TypesOfCustomsFileLightTransaction.CustomsFileLight
		ИЛИ Параметры.TypeOfTransaction = Перечисления.TypesOfCustomsFileLightTransaction.CustomsBond Тогда
		
		ДоступныеItems = Документы.CustomsFilesLight.ПолучитьДоступныеItemsДляCustomsFileИCustomsBond(
			Параметры.TypeOfTransaction,
			Параметры.Shipment,
			Параметры.ParentCompany,
			Параметры.PermanentTemporary,
			Параметры.PSAContract,
			Параметры.CurrentCustomsFileLight);
									
	ИначеЕсли Параметры.TypeOfTransaction = Перечисления.TypesOfCustomsFileLightTransaction.CustomsBondClosing Тогда

		Если ЗначениеЗаполнено(Параметры.CurrentCustomsFileLight) Тогда
			Граница = Новый Граница(Параметры.CurrentCustomsFileLight.МоментВремени(), ВидГраницы.Исключая);
		Иначе
			Граница = Неопределено;                                 
		КонецЕсли;
		
		ТаблицаОстатков = РегистрыНакопления.ItemsWithoutCVCDecision.ПолучитьОстаткиПоCustomsBond(Граница, Параметры.CustomsBond);
		ДоступныеItems = ТаблицаОстатков.ВыгрузитьКолонку("Item");
					
	Иначе
		ВызватьИсключение "Type of transaction '" + Параметры.TypeOfTransaction + "' is not supported!";
			
	КонецЕсли;
	
	// удалим те items, которые уже есть в документе
	ДоступныеItems = РГСофтКлиентСервер.ВычестьМассивы(ДоступныеItems, Параметры.CurrentItems);
	
	Если ДоступныеItems.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"No free items found!",
			, , , Отказ);
	КонецЕсли;
	
	ТаблицаItems.Загрузить(Документы.CustomsFilesLight.ПолучитьРеквизитыItems(ДоступныеItems, Параметры.ImportExport));
		
КонецПроцедуры

&НаКлиенте
Процедура SelectChosen(Команда)
	
	СтрокаВозвращаемыхКолонок = ПолучитьСтрокуВозвращаемыхКолонок();
	МассивСтруктур = Новый Массив;
	Для Каждого ВыделеннаяСтрока Из Элементы.ТаблицаItems.ВыделенныеСтроки Цикл
		
		СтрокаТаблицы = ТаблицаItems.НайтиПоИдентификатору(ВыделеннаяСтрока);
		Структура = Новый Структура(СтрокаВозвращаемыхКолонок);
		ЗаполнитьЗначенияСвойств(Структура, СтрокаТаблицы, СтрокаВозвращаемыхКолонок);
		МассивСтруктур.Добавить(Структура);
		
	КонецЦикла;
	
	Если МассивСтруктур.Количество() Тогда
		ОповеститьОВыборе(МассивСтруктур);
	Иначе
		Сообщить("No item chosen!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура SelectAll(Команда)
	
	СтрокаВозвращаемыхКолонок = ПолучитьСтрокуВозвращаемыхКолонок();
	МассивСтруктур = Новый Массив;
	Для Каждого СтрокаТаблицы Из ТаблицаItems Цикл
		
		Структура = Новый Структура(СтрокаВозвращаемыхКолонок);
		ЗаполнитьЗначенияСвойств(Структура, СтрокаТаблицы, СтрокаВозвращаемыхКолонок);
		МассивСтруктур.Добавить(Структура);
		
	КонецЦикла;
	
	Если МассивСтруктур.Количество() Тогда
		ОповеститьОВыборе(МассивСтруктур);
	Иначе
		Сообщить("No item chosen!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтрокуВозвращаемыхКолонок()
	
	Возврат "Item, InvoiceHTC, ParcelsNetWeight, WeightUOMCode, POno, PartNo, SerialNo, Description, Qty, QtyUOMCOde, Price, CurrencyNameEng, TotalPrice";
	
КонецФункции

&НаКлиенте
Процедура ТаблицаItemsВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	SelectChosen(Неопределено);
	
КонецПроцедуры
